## Movie Success Prediction

In [2]:
#Importing Required Libraries

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [4]:
#Loading Dataset 

#IMDB=pd.read_csv('IMDB-Movie-Data.csv')
IMDB = pd.read_csv('data/IMDB-Movie-Data.csv', index_col=0)
IMDB

,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Rank,,,,,,,,,,,
1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
2,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
3,Split,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
4,Sing,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
5,Suicide Squad,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0
...,...,...,...,...,...,...,...,...,...,...,...
996,Secret in Their Eyes,"Crime,Drama,Mystery","A tight-knit team of rising investigators, alo...",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,27585,NaN,45.0
997,Hostel: Part II,Horror,Three American college students studying abroa...,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,73152,17.54,46.0
998,Step Up 2: The Streets,"Drama,Music,Romance",Romantic sparks occur between two dance studen...,Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,70699,58.01,50.0
999,Search Party,"Adventure,Comedy",A pair of friends embark on a mission to reuni...,Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,4881,NaN,22.0
1000,Nine Lives,"Comedy,Family,Fantasy",A stuffy businessman finds himself trapped ins...,Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,12435,19.64,11.0

In [ ]:
IMDB.describe()

In [139]:
#Selecting needed columns from Dataframe
X = pd.DataFrame(IMDB.drop(['Title','Genre', 'Description', 'Director', 'Actors','Metascore'], axis=1))
y = pd.DataFrame(IMDB.Metascore)

In [140]:
y

      Metascore
Rank
1          76.0
2          65.0
3          62.0
4          59.0
5          40.0
...         ...
996        45.0
997        46.0
998        50.0
999        22.0
1000       11.0

[1000 rows x 1 columns]

In [141]:
#Adding Missing Values to the Columns
 
from sklearn.impute import SimpleImputer

#imputer_X = SimpleImputer(missing_values="NaN", strategy="mean")
#imputer_y = SimpleImputer(missing_values="NaN", strategy="mean")

imputer_X = SimpleImputer(missing_values = np.nan, strategy="mean")
imputer_y = SimpleImputer(missing_values = np.nan, strategy="mean")

imputer_X.fit(X)
X = imputer_X.transform(X)
# 'Rank','Year','Runtime (Minutes)','Rating','Votes','Revenue (Millions)'

imputer_y.fit(y)
y = imputer_y.transform(y)

In [142]:
X = pd.DataFrame(X, columns= ['Year','Runtime (Minutes)','Rating','Votes','Revenue (Millions)'])
y = pd.DataFrame(y, columns= ['Metascore'])

In [143]:
X

       Year  Runtime (Minutes)  Rating     Votes  Revenue (Millions)
0    2014.0              121.0     8.1  757074.0          333.130000
1    2012.0              124.0     7.0  485820.0          126.460000
2    2016.0              117.0     7.3  157606.0          138.120000
3    2016.0              108.0     7.2   60545.0          270.320000
4    2016.0              123.0     6.2  393727.0          325.020000
..      ...                ...     ...       ...                 ...
995  2015.0              111.0     6.2   27585.0           82.956376
996  2007.0               94.0     5.5   73152.0           17.540000
997  2008.0               98.0     6.2   70699.0           58.010000
998  2014.0               93.0     5.6    4881.0           82.956376
999  2016.0               87.0     5.3   12435.0           19.640000

[1000 rows x 5 columns]

In [144]:
y

     Metascore
0         76.0
1         65.0
2         62.0
3         59.0
4         40.0
..         ...
995       45.0
996       46.0
997       50.0
998       22.0
999       11.0

[1000 rows x 1 columns]

In [154]:
#Feature Scaling
from sklearn.preprocessing import StandardScaler

Scale = StandardScaler()
X_Scaled = pd.DataFrame (Scale.fit_transform(X), columns= ['Year','Runtime (Minutes)','Rating','Votes','Revenue (Millions)'])
y_Scaled = pd.DataFrame (Scale.fit_transform(y), columns= ['Metascore'])

In [155]:
X_Scaled

         Year  Runtime (Minutes)    Rating     Votes  Revenue (Millions)
0    0.379795           0.416350  1.456999  3.112690            2.596136
1   -0.244355           0.575911  0.292924  1.674960            0.451452
2    1.003945           0.203601  0.610399 -0.064676            0.572452
3    1.003945          -0.275084  0.504574 -0.579129            1.944336
4    1.003945           0.522724 -0.553677  1.186839            2.511976
..        ...                ...       ...       ...                 ...
995  0.691870          -0.115523 -0.553677 -0.753827            0.000000
996 -1.804730          -1.019706 -1.294452 -0.512308           -0.678848
997 -1.492655          -0.806957 -0.553677 -0.525310           -0.258877
998  0.379795          -1.072893 -1.188627 -0.874165            0.000000
999  1.003945          -1.392017 -1.506102 -0.834127           -0.657055

[1000 rows x 5 columns]

In [156]:
y_Scaled

     Metascore
0     1.023361
1     0.361768
2     0.181334
3     0.000900
4    -1.141852
..         ...
995  -0.841128
996  -0.780983
997  -0.540404
998  -2.224458
999  -2.886051

[1000 rows x 1 columns]

In [157]:
#Spliting the Dataset for Training and Testing
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(X_Scaled, y_Scaled, test_size=0.2, random_state=0)

In [158]:
#Creating Multiple Linear Regression Model
from sklearn.linear_model import LinearRegression

y_predictor = LinearRegression()
y_predictor.fit(X_train, y_train)
y_predicted = y_predictor.predict(X_test)

In [162]:
#Regression Analysis

from sklearn.metrics import mean_squared_error, r2_score, confusion_matrix


print ("R Score of the Model: " + str(mean_squared_error(y_test, y_predicted)))
print ("R^2 Score of the Model: " + str(r2_score(y_test, y_predicted)))

#print (y_predictor.coef_)
#print (y_predictor.intercept_)
#print (y_predictor.rank_)

R Score of the Model: 0.7228142471563291
R^2 Score of the Model: 0.3158278882899359
[[ 0.06206863 -0.05250785  0.59427797  0.05606748  0.01552287]]
[0.00075882]
5

In [5]:
ipython locate

SyntaxError: invalid syntax (<ipython-input-5-c870fd29cace>, line 1)